# vim: syntax=ruby filetype=ruby

tap "thoughtbot/formulae"
# rcm: dotfile management
brew "rcm"

# updated versions of core tools
brew "git"
brew "vim"
brew "zsh"

# utilities used by config files and plugins
brew "ripgrep"
brew "ack"
brew "fzf"
brew "ctags"

# other useful utilities
brew "p7zip"
brew "tree"
brew "pstree"
brew "wget"
brew "gnupg"
brew "hexyl"
brew "graphviz"

brew "tig"
brew "htop"

# sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew "jq"

# macOS ships with version 2.8. Get version 3.4+ so `diff --color` works.
brew "diffutils"

# a modern Vim fork
brew "neovim"
