# vim: syntax=ruby filetype=ruby

brew "ack"
brew "age"
brew "bat"
brew "ctags"
brew "direnv"
brew "editorconfig"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "glab"
brew "graphviz"
brew "hexyl"
brew "mdcat"
brew "multimarkdown"
brew "pstree"
brew "ripgrep"
brew "sevenzip"
brew "tmux"
brew "tree"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "vim"
brew "wget"
brew "xz"

## useful TUI utilities
brew "broot"
brew "btop"
brew "htop"
brew "lazygit"
brew "ncdu"
brew "tig"

# sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew "jq"
# jq-like utility for yaml files
brew "yq"

# Improved file diff tools
brew "git-delta"
brew "diff-so-fancy"
brew "difftastic"
# macOS ships with an older version that doesn't support `diff --color`.
brew "diffutils"

# Personal manpages, written in Markdown
brew "um"

# System information utility, with terminal colors sample.
brew "fastfetch"

# a modern Vim fork
brew "neovim"

# Go development utilities
brew "go"
brew "gopls"
brew "gofumpt"

# Jujutsu VCS
brew "jj"
brew "jjui"
 
# Tool version managers
brew "mise"
