# vim: syntax=ruby filetype=ruby

tap "thoughtbot/formulae"
# rcm: dotfile management
brew "rcm"

brew "ack"
brew "bat"
brew "ctags"
brew "diff-so-fancy"
brew "direnv"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "graphviz"
brew "hexyl"
brew "hub"
brew "jump"
brew "p7zip"
brew "pstree"
brew "ripgrep"
brew "tree"
brew "vim"
brew "wget"
brew "xz"
brew "z"

## useful ncurses utilities
brew "htop"
brew "ncdu"
brew "tig"

# sed for json: https://robots.thoughtbot.com/jq-is-sed-for-json
brew "jq"
# jq-like utility for yaml files
brew "yq"

# macOS ships with an older version that doesn't support `diff --color`.
brew "diffutils"

# Personal manpages, written in Markdown
brew "um"

# Prompt: https://starship.rs
brew "starship"

# Git Large File Support
brew "git-lfs"

# a modern Vim fork
brew "neovim"
